#ifndef _SUPPORT_H_
#define _SUPPORT_H_

#include "string.h"
#include "protocol.h"
#include "fifo.h"
#include "mf_crc.h"
#include "mem_mang.h"
#include "protocol_common.h"
#include "protocol_interface.h"
#include "protocol_transmit.h"
#include "support.h"



/********************************************************************************************************/
//通信协议的初始化
/********************************************************************************************************/
void real_protocol_init(void);


/********************************************************************************************************/
//发送函数
//返回类型：void
//形参表:                       uwb的数据                     底盘信息
/********************************************************************************************************/
void real_protocol_send(void);


/********************************************************************************************************/
//接收函数
//返回类型  void
//形参表：void
/********************************************************************************************************/
void real_protocol_receive(void);



#endif

